test_examples/tube_OpenFoam3d_abaqus3d/CFD_Own_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          320;
        startFace       44992;
    }
    outlet
    {
        type            patch;
        nFaces          320;
        startFace       45312;
    }
    mantle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1536;
        startFace       45632;
    }
)

// ************************************************************************* //
